In [1]:
import pandas as pd
import numpy as np
data = pd.read_csv("conversion_rates.csv")

In [2]:
data.head()

   converted group
0          0     B
1          0     B
2          0     A
3          0     B
4          0     A

In [3]:
data.groupby('group').sum()

       converted
group
A             90
B             21

In [4]:
data.groupby('group').sum().stack()

group
A      converted    90
B      converted    21
dtype: int64

In [5]:
data.groupby('group').count()

       converted
group
A           1030
B            970

In [6]:
data.groupby('group').sum().stack()

group
A      converted    90
B      converted    21
dtype: int64

In [7]:
data.groupby('group').sum().unstack()

           group
converted  A        90
           B        21
dtype: int64

In [11]:
data.pivot_table(index = 'group', columns = ['converted'], aggfunc = np.sum)

Empty DataFrame
Columns: []
Index: [A, B]

In [17]:
data.pivot_table(index='group', columns='converted', aggfunc=len)

converted    0   1
group
A          940  90
B          949  21

In [18]:
data.head()

   converted group
0          0     B
1          0     B
2          0     A
3          0     B
4          0     A